const itemsPerPage = 10;              // 每一個分頁要顯示的資料數量

const operation_lines = [
    { id: "LINE_WN", dsc: "西部幹線北段(基隆-竹南)" },
    { id: "LINE_WM", dsc: "西部幹線台中線(竹南-彰化，經苗栗)" },
    { id: "LINE_WSEA", dsc: "西部幹線海岸線(竹南-彰化，經大甲)" },
    { id: "LINE_WS", dsc: "西部幹線南段(彰化-高雄)" },
    { id: "LINE_P", dsc: "屏東線(高雄-枋寮)" },
    { id: "LINE_S", dsc: "南迴線(枋寮-台東)" },
    { id: "LINE_T", dsc: "台東線(花蓮-台東)" },
    { id: "LINE_N", dsc: "北迴線(蘇澳新-花蓮)" },
    { id: "LINE_I", dsc: "宜蘭線(八堵-蘇澳)" },
    { id: "LINE_PX", dsc: "平溪深澳線(八斗子-菁桐)" },
    { id: "LINE_LJ", dsc: "內灣線(新竹-內灣)" },
    { id: "LINE_NW", dsc: "六家線(新竹-六家)" },
    { id: "LINE_J", dsc: "集集線(二水-車埕)" },
    { id: "LINE_SL", dsc: "沙崙線(中洲-沙崙)" }
]

const line_dir_kind = [
    { id: 1, dsc: "順行" },
    { id: 2, dsc: "逆行" }
];

const line_kind = [
    { id: 0, dsc: "不經過山海線" },
    { id: 1, dsc: "經過山線" },
    { id: 2, dsc: "經過海線" },
    { id: 3, dsc: "經過成追線" },
    { id: 4, dsc: "經過山海線" }
];

const car_kind = [
    { id: "1100", dsc: "柴油自強號" },
    { id: "1101", dsc: "太魯閣號" },
    { id: "1102", dsc: "太魯閣號" },
    { id: "1103", dsc: "柴油自強號" },
    { id: "1104", dsc: "專列" },
    { id: "1105", dsc: "PP推拉式自強號" },
    { id: "1106", dsc: "PP推拉式自強號" },
    { id: "1107", dsc: "普悠瑪號" },
    { id: "1108", dsc: "PP推拉式自強號" },
    { id: "1109", dsc: "PP推拉式自強號" },
    { id: "1110", dsc: "莒光號" },
    { id: "1111", dsc: "莒光號" },
    { id: "1112", dsc: "莒光號" },
    { id: "1114", dsc: "莒光號" },
    { id: "1115", dsc: "莒光號" },
    { id: "1120", dsc: "復興號" },
    { id: "1131", dsc: "區間車" },
    { id: "1132", dsc: "區間快" },
    { id: "1140", dsc: "普快車" },
    { id: "110A", dsc: "PP推拉式自強號" },
    { id: "110B", dsc: "EMU1200" },
    { id: "110C", dsc: "EMU300" },
    { id: "110D", dsc: "柴油自強號" },
    { id: "110E", dsc: "柴油自強號" },
    { id: "110F", dsc: "柴油自強號" },
    { id: "110G", dsc: "EMU3000自強號" },
    { id: "110H", dsc: "EMU3000自強號" },
    { id: "0000", dsc: "其他" }
]

const stations_kind = [
    {
        "id": "0900",
        "dsc": "基隆"
    },
    {
        "id": "0910",
        "dsc": "三坑"
    },
    {
        "id": "0920",
        "dsc": "八堵"
    },
    {
        "id": "0930",
        "dsc": "七堵"
    },
    {
        "id": "0940",
        "dsc": "百福"
    },
    {
        "id": "0950",
        "dsc": "五堵"
    },
    {
        "id": "0960",
        "dsc": "汐止"
    },
    {
        "id": "0970",
        "dsc": "汐科"
    },
    {
        "id": "0980",
        "dsc": "南港"
    },
    {
        "id": "0990",
        "dsc": "松山"
    },
    {
        "id": "1000",
        "dsc": "臺北"
    },
    {
        "id": "1001",
        "dsc": "臺北(環島終點)"
    },
    {
        "id": "1010",
        "dsc": "萬華"
    },
    {
        "id": "1020",
        "dsc": "板橋"
    },
    {
        "id": "1030",
        "dsc": "浮洲"
    },
    {
        "id": "1040",
        "dsc": "樹林"
    },
    {
        "id": "1050",
        "dsc": "南樹林"
    },
    {
        "id": "1060",
        "dsc": "山佳"
    },
    {
        "id": "1070",
        "dsc": "鶯歌"
    },
    {
        "id": "1080",
        "dsc": "桃園"
    },
    {
        "id": "1090",
        "dsc": "內壢"
    },
    {
        "id": "1100",
        "dsc": "中壢"
    },
    {
        "id": "1110",
        "dsc": "埔心"
    },
    {
        "id": "1120",
        "dsc": "楊梅"
    },
    {
        "id": "1130",
        "dsc": "富岡"
    },
    {
        "id": "1140",
        "dsc": "新富"
    },
    {
        "id": "1150",
        "dsc": "北湖"
    },
    {
        "id": "1160",
        "dsc": "湖口"
    },
    {
        "id": "1170",
        "dsc": "新豐"
    },
    {
        "id": "1180",
        "dsc": "竹北"
    },
    {
        "id": "1190",
        "dsc": "北新竹"
    },
    {
        "id": "1210",
        "dsc": "新竹"
    },
    {
        "id": "1220",
        "dsc": "三姓橋"
    },
    {
        "id": "1230",
        "dsc": "香山"
    },
    {
        "id": "1240",
        "dsc": "崎頂"
    },
    {
        "id": "1250",
        "dsc": "竹南"
    },
    {
        "id": "3140",
        "dsc": "造橋"
    },
    {
        "id": "3150",
        "dsc": "豐富"
    },
    {
        "id": "3160",
        "dsc": "苗栗"
    },
    {
        "id": "3170",
        "dsc": "南勢"
    },
    {
        "id": "3180",
        "dsc": "銅鑼"
    },
    {
        "id": "3190",
        "dsc": "三義"
    },
    {
        "id": "3210",
        "dsc": "泰安"
    },
    {
        "id": "3220",
        "dsc": "后里"
    },
    {
        "id": "3230",
        "dsc": "豐原"
    },
    {
        "id": "3240",
        "dsc": "栗林"
    },
    {
        "id": "3250",
        "dsc": "潭子"
    },
    {
        "id": "3260",
        "dsc": "頭家厝"
    },
    {
        "id": "3270",
        "dsc": "松竹"
    },
    {
        "id": "3280",
        "dsc": "太原"
    },
    {
        "id": "3290",
        "dsc": "精武"
    },
    {
        "id": "3300",
        "dsc": "臺中"
    },
    {
        "id": "3310",
        "dsc": "五權"
    },
    {
        "id": "3320",
        "dsc": "大慶"
    },
    {
        "id": "3330",
        "dsc": "烏日"
    },
    {
        "id": "3340",
        "dsc": "新烏日"
    },
    {
        "id": "3350",
        "dsc": "成功"
    },
    {
        "id": "2110",
        "dsc": "談文"
    },
    {
        "id": "2120",
        "dsc": "大山"
    },
    {
        "id": "2130",
        "dsc": "後龍"
    },
    {
        "id": "2140",
        "dsc": "龍港"
    },
    {
        "id": "2150",
        "dsc": "白沙屯"
    },
    {
        "id": "2160",
        "dsc": "新埔"
    },
    {
        "id": "2170",
        "dsc": "通霄"
    },
    {
        "id": "2180",
        "dsc": "苑裡"
    },
    {
        "id": "2190",
        "dsc": "日南"
    },
    {
        "id": "2200",
        "dsc": "大甲"
    },
    {
        "id": "2210",
        "dsc": "臺中港"
    },
    {
        "id": "2220",
        "dsc": "清水"
    },
    {
        "id": "2230",
        "dsc": "沙鹿"
    },
    {
        "id": "2240",
        "dsc": "龍井"
    },
    {
        "id": "2250",
        "dsc": "大肚"
    },
    {
        "id": "2260",
        "dsc": "追分"
    },
    {
        "id": "3360",
        "dsc": "彰化"
    },
    {
        "id": "3370",
        "dsc": "花壇"
    },
    {
        "id": "3380",
        "dsc": "大村"
    },
    {
        "id": "3390",
        "dsc": "員林"
    },
    {
        "id": "3400",
        "dsc": "永靖"
    },
    {
        "id": "3410",
        "dsc": "社頭"
    },
    {
        "id": "3420",
        "dsc": "田中"
    },
    {
        "id": "3430",
        "dsc": "二水"
    },
    {
        "id": "3450",
        "dsc": "林內"
    },
    {
        "id": "3460",
        "dsc": "石榴"
    },
    {
        "id": "3470",
        "dsc": "斗六"
    },
    {
        "id": "3480",
        "dsc": "斗南"
    },
    {
        "id": "3490",
        "dsc": "石龜"
    },
    {
        "id": "4050",
        "dsc": "大林"
    },
    {
        "id": "4060",
        "dsc": "民雄"
    },
    {
        "id": "4070",
        "dsc": "嘉北"
    },
    {
        "id": "4080",
        "dsc": "嘉義"
    },
    {
        "id": "4090",
        "dsc": "水上"
    },
    {
        "id": "4100",
        "dsc": "南靖"
    },
    {
        "id": "4110",
        "dsc": "後壁"
    },
    {
        "id": "4120",
        "dsc": "新營"
    },
    {
        "id": "4130",
        "dsc": "柳營"
    },
    {
        "id": "4140",
        "dsc": "林鳳營"
    },
    {
        "id": "4150",
        "dsc": "隆田"
    },
    {
        "id": "4160",
        "dsc": "拔林"
    },
    {
        "id": "4170",
        "dsc": "善化"
    },
    {
        "id": "4180",
        "dsc": "南科"
    },
    {
        "id": "4190",
        "dsc": "新市"
    },
    {
        "id": "4200",
        "dsc": "永康"
    },
    {
        "id": "4210",
        "dsc": "大橋"
    },
    {
        "id": "4220",
        "dsc": "台南"
    },
    {
        "id": "4250",
        "dsc": "保安"
    },
    {
        "id": "4260",
        "dsc": "仁德"
    },
    {
        "id": "4270",
        "dsc": "中洲"
    },
    {
        "id": "4290",
        "dsc": "大湖"
    },
    {
        "id": "4300",
        "dsc": "路竹"
    },
    {
        "id": "4310",
        "dsc": "岡山"
    },
    {
        "id": "4320",
        "dsc": "橋頭"
    },
    {
        "id": "4330",
        "dsc": "楠梓"
    },
    {
        "id": "4340",
        "dsc": "新左營"
    },
    {
        "id": "4350",
        "dsc": "左營"
    },
    {
        "id": "4360",
        "dsc": "內惟"
    },
    {
        "id": "4370",
        "dsc": "美術館"
    },
    {
        "id": "4380",
        "dsc": "鼓山"
    },
    {
        "id": "4390",
        "dsc": "三塊厝"
    },
    {
        "id": "4400",
        "dsc": "高雄"
    },
    {
        "id": "4410",
        "dsc": "民族"
    },
    {
        "id": "4420",
        "dsc": "科工館"
    },
    {
        "id": "4430",
        "dsc": "正義"
    },
    {
        "id": "4440",
        "dsc": "鳳山"
    },
    {
        "id": "4450",
        "dsc": "後庄"
    },
    {
        "id": "4460",
        "dsc": "九曲堂"
    },
    {
        "id": "4470",
        "dsc": "六塊厝"
    },
    {
        "id": "5000",
        "dsc": "屏東"
    },
    {
        "id": "5010",
        "dsc": "歸來"
    },
    {
        "id": "5020",
        "dsc": "麟洛"
    },
    {
        "id": "5030",
        "dsc": "西勢"
    },
    {
        "id": "5040",
        "dsc": "竹田"
    },
    {
        "id": "5050",
        "dsc": "潮州"
    },
    {
        "id": "5060",
        "dsc": "崁頂"
    },
    {
        "id": "5070",
        "dsc": "南州"
    },
    {
        "id": "5080",
        "dsc": "鎮安"
    },
    {
        "id": "5090",
        "dsc": "林邊"
    },
    {
        "id": "5100",
        "dsc": "佳冬"
    },
    {
        "id": "5110",
        "dsc": "東海"
    },
    {
        "id": "5120",
        "dsc": "枋寮"
    },
    {
        "id": "5130",
        "dsc": "加祿"
    },
    {
        "id": "5140",
        "dsc": "內獅"
    },
    {
        "id": "5160",
        "dsc": "枋山"
    },
    {
        "id": "5170",
        "dsc": "枋野"
    },
    {
        "id": "5190",
        "dsc": "大武"
    },
    {
        "id": "5200",
        "dsc": "瀧溪"
    },
    {
        "id": "5210",
        "dsc": "金崙"
    },
    {
        "id": "5220",
        "dsc": "太麻里"
    },
    {
        "id": "5230",
        "dsc": "知本"
    },
    {
        "id": "5240",
        "dsc": "康樂"
    },
    {
        "id": "6000",
        "dsc": "台東"
    },
    {
        "id": "6010",
        "dsc": "山里"
    },
    {
        "id": "6020",
        "dsc": "鹿野"
    },
    {
        "id": "6030",
        "dsc": "瑞源"
    },
    {
        "id": "6040",
        "dsc": "瑞和"
    },
    {
        "id": "6050",
        "dsc": "關山"
    },
    {
        "id": "6060",
        "dsc": "海端"
    },
    {
        "id": "6070",
        "dsc": "池上"
    },
    {
        "id": "6080",
        "dsc": "富里"
    },
    {
        "id": "6090",
        "dsc": "東竹"
    },
    {
        "id": "6100",
        "dsc": "東里"
    },
    {
        "id": "6110",
        "dsc": "玉里"
    },
    {
        "id": "6120",
        "dsc": "三民"
    },
    {
        "id": "6130",
        "dsc": "瑞穗"
    },
    {
        "id": "6140",
        "dsc": "富源"
    },
    {
        "id": "6150",
        "dsc": "大富"
    },
    {
        "id": "6160",
        "dsc": "光復"
    },
    {
        "id": "6170",
        "dsc": "萬榮"
    },
    {
        "id": "6180",
        "dsc": "鳳林"
    },
    {
        "id": "6190",
        "dsc": "南平"
    },
    {
        "id": "6200",
        "dsc": "林榮新光"
    },
    {
        "id": "6210",
        "dsc": "豐田"
    },
    {
        "id": "6220",
        "dsc": "壽豐"
    },
    {
        "id": "6230",
        "dsc": "平和"
    },
    {
        "id": "6240",
        "dsc": "志學"
    },
    {
        "id": "6250",
        "dsc": "吉安"
    },
    {
        "id": "7000",
        "dsc": "花蓮"
    },
    {
        "id": "7010",
        "dsc": "北埔"
    },
    {
        "id": "7020",
        "dsc": "景美"
    },
    {
        "id": "7030",
        "dsc": "新城"
    },
    {
        "id": "7040",
        "dsc": "崇德"
    },
    {
        "id": "7050",
        "dsc": "和仁"
    },
    {
        "id": "7060",
        "dsc": "和平"
    },
    {
        "id": "7070",
        "dsc": "漢本"
    },
    {
        "id": "7080",
        "dsc": "武塔"
    },
    {
        "id": "7090",
        "dsc": "南澳"
    },
    {
        "id": "7100",
        "dsc": "東澳"
    },
    {
        "id": "7110",
        "dsc": "永樂"
    },
    {
        "id": "7120",
        "dsc": "蘇澳"
    },
    {
        "id": "7130",
        "dsc": "蘇澳新"
    },
    {
        "id": "7140",
        "dsc": "新馬"
    },
    {
        "id": "7150",
        "dsc": "冬山"
    },
    {
        "id": "7160",
        "dsc": "羅東"
    },
    {
        "id": "7170",
        "dsc": "中里"
    },
    {
        "id": "7180",
        "dsc": "二結"
    },
    {
        "id": "7190",
        "dsc": "宜蘭"
    },
    {
        "id": "7200",
        "dsc": "四城"
    },
    {
        "id": "7210",
        "dsc": "礁溪"
    },
    {
        "id": "7220",
        "dsc": "頂埔"
    },
    {
        "id": "7230",
        "dsc": "頭城"
    },
    {
        "id": "7240",
        "dsc": "外澳"
    },
    {
        "id": "7250",
        "dsc": "龜山"
    },
    {
        "id": "7260",
        "dsc": "大溪"
    },
    {
        "id": "7270",
        "dsc": "大里"
    },
    {
        "id": "7280",
        "dsc": "石城"
    },
    {
        "id": "7290",
        "dsc": "福隆"
    },
    {
        "id": "7300",
        "dsc": "貢寮"
    },
    {
        "id": "7310",
        "dsc": "雙溪"
    },
    {
        "id": "7320",
        "dsc": "牡丹"
    },
    {
        "id": "7330",
        "dsc": "三貂嶺"
    },
    {
        "id": "7350",
        "dsc": "侯硐"
    },
    {
        "id": "7360",
        "dsc": "瑞芳"
    },
    {
        "id": "7380",
        "dsc": "四腳亭"
    },
    {
        "id": "7390",
        "dsc": "暖暖"
    },
    {
        "id": "1191",
        "dsc": "千甲"
    },
    {
        "id": "1192",
        "dsc": "新莊"
    },
    {
        "id": "1193",
        "dsc": "竹中"
    },
    {
        "id": "1194",
        "dsc": "六家"
    },
    {
        "id": "1201",
        "dsc": "上員"
    },
    {
        "id": "1202",
        "dsc": "榮華"
    },
    {
        "id": "1203",
        "dsc": "竹東"
    },
    {
        "id": "1204",
        "dsc": "橫山"
    },
    {
        "id": "1205",
        "dsc": "九讚頭"
    },
    {
        "id": "1206",
        "dsc": "合興"
    },
    {
        "id": "1207",
        "dsc": "富貴"
    },
    {
        "id": "1208",
        "dsc": "內灣"
    },
    {
        "id": "7362",
        "dsc": "八斗子"
    },
    {
        "id": "7361",
        "dsc": "海科館"
    },
    {
        "id": "7331",
        "dsc": "大華"
    },
    {
        "id": "7332",
        "dsc": "十分"
    },
    {
        "id": "7333",
        "dsc": "望古"
    },
    {
        "id": "7334",
        "dsc": "嶺腳"
    },
    {
        "id": "7335",
        "dsc": "平溪"
    },
    {
        "id": "7336",
        "dsc": "菁桐"
    },
    {
        "id": "3431",
        "dsc": "源泉"
    },
    {
        "id": "3432",
        "dsc": "濁水"
    },
    {
        "id": "3433",
        "dsc": "龍泉"
    },
    {
        "id": "3434",
        "dsc": "集集"
    },
    {
        "id": "3435",
        "dsc": "水里"
    },
    {
        "id": "3436",
        "dsc": "車埕"
    },
    {
        "id": "4271",
        "dsc": "長榮大學"
    },
    {
        "id": "4272",
        "dsc": "沙崙"
    }
]